Autodesk.Revit.DB.Geolocation.GeolocationBoundingBox.IsEmpty
Determines if the bounding box represents an empty area.
Returns:
true if min and max of the bounding box are almost equal, false otherwise.

Autodesk.Revit.DB.Geolocation.GeolocationBoundingBox.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Geolocation.GeolocationBoundingBox
Represents a bounding box within Geolocation services.